In [2]:
import psycopg2

In [3]:
host_ip = "172.17.0.2" #for emilio 172.17.0.4

In [71]:
# create gallery database
try:
    conn = psycopg2.connect(user="postgres", password="mysecretpassword", host=host_ip)
except:
    print("connecting failed")
    
conn.set_session(autocommit=True)
cur = conn.cursor()
cur.execute("CREATE DATABASE gallery;")
conn.close()

ProgrammingError: syntax error at or near "OFF"
LINE 1: ALTER DATABASE gallery SET RECURSIVE_TRIGGERS OFF;
                                                      ^

In [112]:
# connect to gallery database
try:
    conn = psycopg2.connect(dbname="gallery", user="postgres", password="mysecretpassword", host=host_ip)
except:
    print("connecting failed")

conn.set_session(autocommit=True)
cur = conn.cursor()

In [115]:
#create tables
try:
    cur.execute(open("schema.sql", "r").read())
except Exception as e:
    print("could not create tables", e)

could not create tables syntax error at or near "*"
LINE 39: DROP TRIGGER * on customer;
                      ^

In [116]:
cur.execute("INSERT INTO customer VALUES(123, 'erik', 'aweg', '062342352')"  )

OperationalError: stack depth limit exceeded
HINT:  Increase the configuration parameter "max_stack_depth" (currently 2048kB), after ensuring the platform's stack depth limit is adequate.
CONTEXT:  SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"
PL/pgSQL function customer_to_uppercase() line 11 at SQL statement
SQL statement "INSERT INTO customer VALUES(NEW.cust_no, UPPER(NEW.cust_name), NEW.cust_addr, NEW.cust_phone)"

In [82]:
cur.execute("SELECT * FROM customer")
cur.fetchall()

[]